Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils.CalculateExtrusionData(Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions,System.Collections.Generic.IList`1{Autodesk.Revit.DB.Face})
Calculates the extrusion data from a collection of Revit geometry faces.
extrInfo:
The options for extrusion extraction.
allInputFaces:
The collection of faces.
Returns:
A collection of extrusion data calculated for the geometry.
If the function fails to calculate one or more valid extrusions,
this collection will be empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils.CalculateExtrusionData(Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions,Autodesk.Revit.DB.GeometryObject)
Calculates the extrusion data from a Revit geometry object.
extrusionOptions:
The options for extrusion extraction.
geometryObject:
The geometry object.
Returns:
A collection of extrusion data calculated for the geometry.
If the function fails to calculate one or more valid extrusions,
this collection will be empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012